20260127072229-casting_between_char_and_numeric_types.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Casting Between char and Numeric Types</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Casting Between char and Numeric Types</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7075de6">1. Casting Between char and Numeric Types</a>
<ul>
<li><a href="#orgc9ec38e">1.1. Explanation</a>
<ul>
<li><a href="#org2fdf8d2">1.1.1. Step 1: Write the number in binary/hex</a></li>
<li><a href="#orga2f2474">1.1.2. Step 2: Keep only the lower 16 bits</a></li>
<li><a href="#org3361e42">1.1.3. Step 3: Interpret 0x0041 as a Unicode character</a></li>
</ul>
</li>
<li><a href="#org92b2170">1.2. Floating-Point</a>
<ul>
<li><a href="#org1751f6e">1.2.1. Example</a></li>
</ul>
</li>
<li><a href="#org42d142f">1.3. Char to Numeric</a></li>
<li><a href="#orge322c89">1.4. Implicit Casting</a></li>
<li><a href="#org81e9709">1.5. Explicit Casting</a></li>
<li><a href="#orgc156e52">1.6. Operators</a>
<ul>
<li><a href="#org7380131">1.6.1. Examples</a></li>
</ul>
</li>
<li><a href="#org2874a58">1.7. Comparing and Testing Characters</a>
<ul>
<li><a href="#org8659b6c">1.7.1. Examples</a></li>
<li><a href="#orgc895aa4">1.7.2. Helper Methods</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7075de6" class="outline-2">
<h2 id="org7075de6"><span class="section-number-2">1.</span> Casting Between char and Numeric Types</h2>
<div class="outline-text-2" id="text-1">
<p>
A <code>char</code> can be <a href="20231224190739-widening_primitive_conversion.html#ID-3ef23225-ae37-428e-8ad3-5d7728f59478">cast</a> into any <a href="20260121194236-numeric_data_types.html#ID-4b7774f6-ef98-4e86-ae2c-49961d934c6f">numeric types</a>, (<b>vice</b> <b>versa</b>).
</p>

<p>
When an <code>integer</code> is <b>cast</b> into a <code>char</code>, only its lower (right-most) <code>16 bits</code> of data are used; the other part is ignored.
For example:
</p>

<div class="org-src-container">
<pre class="src src-java">// Note a hex integer is written using prefix 0X
char ch = (char)0XAB0041; // The lower 16 bits hex code 0041 is
                          // assigned to ch
System.out.println(ch);   // ch is character A
</pre>
</div>
</div>

<div id="outline-container-orgc9ec38e" class="outline-3">
<h3 id="orgc9ec38e"><span class="section-number-3">1.1.</span> Explanation</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2fdf8d2" class="outline-4">
<h4 id="org2fdf8d2"><span class="section-number-4">1.1.1.</span> Step 1: Write the number in binary/hex</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<code>0xAB0041</code> is a <code>32-bit</code> <b>int</b>:
</p>

<p>
0xAB0041
= 0x00AB0041 (<code>32 bits</code>)
</p>


<p>
Split it into <b>upper</b> <code>16 bits</code> and <b>lower</b> <code>16 bits</code>:
</p>

<p>
Upper 16 bits: 0xAB00   ← ignored
Lower 16 bits: 0x0041   ← kept
</p>
</div>
</div>

<div id="outline-container-orga2f2474" class="outline-4">
<h4 id="orga2f2474"><span class="section-number-4">1.1.2.</span> Step 2: Keep only the lower 16 bits</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<code>(char) 0xAB0041</code>  →  <code>(char) 0x0041</code>
</p>
</div>
</div>

<div id="outline-container-org3361e42" class="outline-4">
<h4 id="org3361e42"><span class="section-number-4">1.1.3.</span> Step 3: Interpret 0x0041 as a Unicode character</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<code>0x0041</code> = <b>65</b> decimal = <code>'A'</code>
</p>

<p>
<code>System.out.println(ch);  // prints A</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org92b2170" class="outline-3">
<h3 id="org92b2170"><span class="section-number-3">1.2.</span> Floating-Point</h3>
<div class="outline-text-3" id="text-1-2">
<p>
When a <a href="20260121194347-floating_point_types.html#ID-8487dd79-f6a8-49d9-ba32-9b97c5056ef2">floating-point</a> value is <b>cast</b> into a <code>char</code>, the floating-point value is first <b>cast</b> into an <code>int</code>, which is then <b>cast</b> into a <code>char</code>.
</p>
</div>

<div id="outline-container-org1751f6e" class="outline-4">
<h4 id="org1751f6e"><span class="section-number-4">1.2.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-java">char ch = (char)65.25; // Decimal 65 is assigned to ch
System.out.println(ch); // ch is character A
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org42d142f" class="outline-3">
<h3 id="org42d142f"><span class="section-number-3">1.3.</span> Char to Numeric</h3>
<div class="outline-text-3" id="text-1-3">
<p>
When a <code>char</code> is <b>cast</b> into a <code>numeric type</code>, the <b>character’s</b> <a href="20260126075828-unicode.html#ID-25824dca-cd38-447d-84fd-8c69f246709f">Unicode</a> is <b>cast</b> into the specified <code>numeric</code> <code>type</code>.
</p>

<div class="org-src-container">
<pre class="src src-java">int i = (int)'A'; // The Unicode of character A is assigned to i
System.out.println(i); // i is 65
</pre>
</div>
</div>
</div>

<div id="outline-container-orge322c89" class="outline-3">
<h3 id="orge322c89"><span class="section-number-3">1.4.</span> Implicit Casting</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>Implicit</b> <b>casting</b> can be used if the result of a <b>casting</b> fits into the <code>target</code> <code>variable</code>.
Otherwise, <b>explicit</b> <b>casting</b> must be <b>used</b>.
</p>

<p>
For example, since the Unicode of <code>'a'</code> is <code>97</code>, which is <b>within</b> the <b>range</b> of a <code>byte</code>, these implicit castings are fine:
</p>
<div class="org-src-container">
<pre class="src src-java">byte b = 'a';
int i = 'a';
</pre>
</div>

<p>
But the following statement is <b>incorrect</b>, because the Unicode <code>\uFFF4</code> cannot fit into a <code>byte</code>:
</p>

<div class="org-src-container">
<pre class="src src-java">byte b = '\uFFF4';
</pre>
</div>

<p>
Any <b>positive</b> <b>integer</b> between <code>0</code> and <code>FFFF</code> in <a href="20240115075853-hexadecimal_system.html#ID-b89f38cd-57be-4e04-a7b5-e29a011aa637">hexadecimal </a>can be <b>cast</b> into a <code>character</code> <b>implicitly</b>.
</p>

<p>
Any number <b>not</b> in this <b>range</b> <b>must</b> be <b>cast</b> into a <code>char</code> <b>explicitly</b>.
</p>
</div>
</div>

<div id="outline-container-org81e9709" class="outline-3">
<h3 id="org81e9709"><span class="section-number-3">1.5.</span> Explicit Casting</h3>
<div class="outline-text-3" id="text-1-5">
<p>
To force this assignment, use <b>explicit</b> <b>casting</b>, as follows:
</p>

<div class="org-src-container">
<pre class="src src-java">byte b = (byte)'\uFFF4';
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc156e52" class="outline-3">
<h3 id="orgc156e52"><span class="section-number-3">1.6.</span> Operators</h3>
<div class="outline-text-3" id="text-1-6">
<p>
All <a href="20231231061730-arithmetic_operators.html#ID-f6e458df-99cf-45d6-b224-16f325cc1d2b">numeric operators</a> can be applied to <code>char</code> operands.
A <code>char</code> <b>operand</b> is <b>automatically</b> <b>cast</b> into a <code>number</code> if the other operand is a <code>number</code> or a <code>character</code>.
</p>

<p>
If a <code>string</code> is <b>concatenated</b> with a <code>character</code>, the <code>character</code> is <b>converted</b> into a <code>string</code>.
</p>
</div>

<div id="outline-container-org7380131" class="outline-4">
<h4 id="org7380131"><span class="section-number-4">1.6.1.</span> Examples</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-java">int i = '2' + '3'; // (int)'2' is 50 and (int)'3' is 51
System.out.println("i is " + i); // i is 101
int j = 2 + 'a'; // (int)'a' is 97
System.out.println("j is " + j); // j is 99
System.out.println(j + " is the Unicode for character ") + (char)j); // 99 is the Unicode for character c
System.out.println("Chapter " + '2');
</pre>
</div>

<p>
Displays:
</p>
<div class="org-src-container">
<pre class="src src-shell">i is 101
j is 99
99 is the Unicode for character c
Chapter 2
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2874a58" class="outline-3">
<h3 id="org2874a58"><span class="section-number-3">1.7.</span> Comparing and Testing Characters</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Two <code>characters</code> can be <b>compared</b> using the <a href="20231231063707-relational_operators.html#ID-bf93d4e3-f501-4e73-ac07-e1c6653831ba">relational operators</a> just like comparing two <b>numbers</b>.
</p>

<p>
This is done by comparing the <a href="20260126075828-unicode.html#ID-25824dca-cd38-447d-84fd-8c69f246709f">Unicodes</a> of the <b>two</b> <code>characters</code>.
</p>
</div>

<div id="outline-container-org8659b6c" class="outline-4">
<h4 id="org8659b6c"><span class="section-number-4">1.7.1.</span> Examples</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">
<pre class="src src-java">'a' &lt; 'b' is true because the Unicode for 'a' (97) is less than the Unicode for 'b' (98).
'a' &lt; 'A' is false because the Unicodefor 'a'(97) is greater than the Unicodefor 'A' (65).
'1' &lt; '8' is true because the Unicode for '1' (49) is less than the Unicode for '8'
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java">if (ch &gt;= 'A' &amp;&amp; ch &lt;= 'Z')
    System.out.println(ch + " is an uppercase letter");
else if (ch &gt;= 'a' &amp;&amp; ch &lt;= 'z')
    System.out.println(ch + " is a lowercase letter");
else if (ch &gt;= '0' &amp;&amp; ch &lt;= '9')
    System.out.println(ch + " is a numeric character");
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc895aa4" class="outline-4">
<h4 id="orgc895aa4"><span class="section-number-4">1.7.2.</span> Helper Methods</h4>
<div class="outline-text-4" id="text-1-7-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">isDigit(ch)</td>
<td class="org-left">Returns true if the specified character is a digit</td>
</tr>

<tr>
<td class="org-left">isLetter(ch)</td>
<td class="org-left">Returns true if the specified character is a letter</td>
</tr>

<tr>
<td class="org-left">isLetterOrDigit(ch)</td>
<td class="org-left">Returns true if the character is a letter or a digit</td>
</tr>

<tr>
<td class="org-left">isLowerCase(ch)</td>
<td class="org-left">Returns true if the character is a lowercase letter</td>
</tr>

<tr>
<td class="org-left">isUpperCase(ch)</td>
<td class="org-left">Returns true if the character is an uppercase letter</td>
</tr>

<tr>
<td class="org-left">toLowerCase(ch)</td>
<td class="org-left">Returns the lowercase of the specified character</td>
</tr>

<tr>
<td class="org-left">toUpperCase(ch)</td>
<td class="org-left">Returns the uppercase of the specified character</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
<li><a id="orgbbfe058"></a>Examples<br />
<div class="outline-text-5" id="text-1-7-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Statement</th>
<th scope="col" class="org-left">Output</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Character.isDigit('a')</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">Character.isLetter('a')</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">Character.isLowerCase('a')</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">Character.isUpperCase('a')</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">Character.toLowerCase('T')</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-left">Character.toUpperCase('q')</td>
<td class="org-left">Q</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
